;;; ~/.doom.d/lisp/brust-mu4e.el -*- lexical-binding: t; -*-


* Handy hooks
#+begin_src elisp
(defun brust-mu4e-compose-mode-hook nil
  (flyspell-mode 1)
  ;; (auto-save-mode -1)
  (set-fill-column 72)
  ;; (brust-mu4e-add-headers)
  (message-add-header (concat "Date: " (message-make-date)))
  (message-add-header (concat "Message-ID: " (message-make-message-id)))
  (message-insert-headers)
  ;; (message-hide-headers)
  ;; This does not work, since while creating buffer mu4e-compose-type is set to nil.
  ;; (if (eq mu4e-compose-type 'new)
  ;;     (message-goto-to)
  ;;   (message-goto-body))
  )

;; (defun mu4e-compose-new nil
;;   "Start writing a new message."
;;   (interactive)
;;   (mu4e-compose 'new)
;;   (message-goto-to))
;;
;; (defun mu4e-compose-edit nil
;;   "Edit the draft message at point in the headers buffer.
;; This is only possible if the message at point is, in fact, a
;; draft message."
;;   (interactive)
;;   (mu4e-compose 'edit)
;;   (message-sort-headers)
;;   (message-goto-body))

(defadvice mu4e-compose (after move-to-right-place activate)
  (if (eq compose-type 'new)
      (message-goto-to)
    ;; (message-sort-headers)
    (message-goto-body)))

;; (add-hook 'mu4e-view-mode-hook #'mu4e-view-fill-long-lines)
(add-hook 'mu4e-view-mode-hook #'visual-line-mode)
(add-hook 'mu4e-compose-mode-hook #'brust-mu4e-compose-mode-hook)

;; From Ben Maughan: Get some Org functionality in compose buffer
;; (add-hook 'message-mode-hook 'turn-on-orgtbl)
;; (add-hook 'message-mode-hook 'turn-on-orgstruct++)
#+end_src

#+RESULTS:
| brust-mu4e-compose-mode-hook | org-mu4e-compose-org-mode | flyspell-mode |
* Dealing with drafts
#+begin_src elisp
(defun brust-mu4e-add-draft-headers nil
  "Add headers on composing an email"
  (message-add-header "Flags: draft")
  ;; (message-add-header (concat "X-Mailer: mu4e " mu4e-mu-version "; emacs " emacs-version "\n"))
  (message-add-header (concat "Maildir: " mu4e-drafts-folder)))

(defun brust-mu4e-delete-draft-headers nil
  "Remove headers on composing an email"
  (message-cleanup-headers)
  (message-remove-header "Flags")
  (message-remove-header "Maildir"))


(defadvice message-dont-send (before add-draft-headers activate)
  (brust-mu4e-add-draft-headers))

(add-hook 'message-send-hook #'brust-mu4e-delete-draft-headers)
#+end_src

#+RESULTS:
| brust-mu4e-delete-draft-headers |
* Main Menu
 Hack to edit main menu
#+begin_src elisp
(defun brust-mu4e-rebuild-index nil
  (interactive)
  (mu4e~proc-kill)
  (sit-for 0) ;; to efectively kill the proces
  (let ((display-buffer-alist (cons t 'display-buffer-no-window))) ;; to not display the buffer
    (async-shell-command "~/scr/mu/mu/mu index --rebuild" nil)))

(defun brust-mu4e-full-index nil
  (interactive)
  (let ((mu4e-index-cleanup t)      ;; don't do a full cleanup check
        (mu4e-index-lazy-check nil)) ;; don't consider up-to-dated dirs
    (mu4e-update-mail-and-index nil)))

;; (setq mu4e-headers-actions
;;       (append mu4e-headers-actions
;;               (list
;;                ;; Rebuild the whole date base
;;                (cons "Rebuild" 'brust-mu4e-rebuild-index))))

(define-key mu4e-main-mode-map (kbd "R") #'brust-mu4e-rebuild-index)
(define-key mu4e-main-mode-map (kbd "F") #'brust-mu4e-full-index)
(define-key mu4e-main-mode-map (kbd "m") #'brust-inbox-update-mode-line-string)

(defadvice mu4e~main-view (after add-my-keys activate)
  (read-only-mode -1)
  (goto-char (point-max))
  (insert
   "\n\n"
   (propertize "  Mines [Hard adviced]\n\n" 'face 'mu4e-title-face)
   (mu4e~main-action-str "\t* [R]ebuild index\n" 'brust-mu4e-rebuild-index)
   (mu4e~main-action-str "\t* [F]ull index\n" 'brust-mu4e-full-index)
   (mu4e~main-action-str "\t* [m]ode line stirng\n" 'brust-inbox-update-mode-line-string))
  (read-only-mode 1)
  (goto-char (point-min)))
#+end_src

#+RESULTS:
: mu4e~main-view
